Ymkkg/STM32_Study/STM32_Study/90_FreeRTOS/Inc/lcd_com.h
#ifndef	LCD_COM_H
#define LCD_COM_H

#include "timer_driver.h"
#include "i2c_driver.h"
#include "stm32f4xx.h"

/*
 * User Define
 */
#define LCD_ADDR    0x27

#define EN          1 << 2
#define BACKLIGHT   1 << 3

#define CLEAR_DISPLAY   do{ LCD_Write_One_Data_Master_To_LCD((I2Cx_Reg_t*)I2C1_ADDR, LCD_ADDR, 0x0); LCD_Write_One_Data_Master_To_LCD((I2Cx_Reg_t*)I2C1_ADDR, LCD_ADDR, 0x1); } while(0)
#define RETURN_HOME   do{ LCD_Write_One_Data_Master_To_LCD((I2Cx_Reg_t*)I2C1_ADDR, LCD_ADDR, 0x0); LCD_Write_One_Data_Master_To_LCD((I2Cx_Reg_t*)I2C1_ADDR, LCD_ADDR, 0x2); } while(0)





void LCD_Init_4Bit_Interface(void);
void LCD_Write_One_Data_Master_To_LCD(I2Cx_Reg_t *pI2Cx, uint8_t addr, uint8_t data);
void LCD_Write_Multiple_Data_Master_To_LCD(I2Cx_Reg_t *pI2Cx, uint8_t addr, uint8_t *data, uint8_t length);
void Cal_SDcard_Usage(uint8_t one, uint8_t ten, uint8_t total);

#endif /* LCD_COM_H */
